Identifier: com.github.discentem.download.Ghostty
Description: Downloads the latest version of Ghostty.
Comment: "Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)"

Input:
  NAME: Ghostty
MinimumVersion: '2.3'
Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: 'ghostty-org/ghostty'
      asset_regex: 'Ghostty.dmg'
      include_prereleases: 'true'
  
  - Processor: EndOfCheckPhase
  
  - Processor: URLDownloader

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/downloads/*.dmg'
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%found_filename%/Ghostty.app'
      requirement: 'identifier "com.mitchellh.ghostty" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "24VZTF6M5V"'
  
  - Processor: Versioner
    Arguments:
      input_plist_path: '%found_filename%/Ghostty.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString

  - Processor: Copier
    Arguments:
      source_path: '%found_filename%'
      destination_path: '%RECIPE_CACHE_DIR%/Ghostty-%version%.dmg'
