Identifier: com.github.discentem.download.Ghostty
Description: Downloads the latest version of Ghostty.
Comment: "Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)"

Input:
  NAME: Ghostty
MinimumVersion: "2.3"
Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: These recipes are deprecated and should use wardsparadox-recipes/Ghostty instead.
  - Processor: EndOfCheckPhase
