Identifier: com.github.discentem.install.Ghostty
Description: A recipe to install https://github.com/ghostty-org/ghostty/
ParentRecipe: com.github.discentem.download.Ghostty
MinimumVersion: "2.3"

Input:
  # Unarchiver requires NAME to be defined
  NAME: Ghostty.app

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: These recipes are deprecated and should use wardsparadox-recipes/Ghostty instead.
