Identifier: com.github.discentem.install.Ghostty
Description: A recipe to install https://github.com/ghostty-org/ghostty/
ParentRecipe: com.github.discentem.download.Ghostty
MinimumVersion: '2.3'

Input:
  # Unarchiver requires NAME to be defined
  NAME: Ghostty.app

Process:
  - Processor: Unarchiver

  - Processor: Copier
    Arguments:
      source_path: '%found_filename%/Ghostty.app'
      destination_path: '/Applications/Ghostty.app'
      overwrite: true
