# Downloaded from https://github.com/autopkg/peetinc-recipes/blob/4d5e1aab90f9de9799d471d2339a4371eeacda29/Cursor/Cursor.pkg.recipe
# Commit: 4d5e1aab90f9de9799d471d2339a4371eeacda29
# Downloaded at: 2025-05-02 02:37:47 UTC

Comment: Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Cursor and creates a package.
Identifier: com.github.peetinc.Cursor
Input:
  NAME: Cursor
MinimumVersion: '2.3'
ParentRecipe: com.github.peetinc.download.Cursor
Process:
- Processor: AppPkgCreator
